<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Carbon\Carbon;

class NewsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $newsArticles = [
            [
                'title' => 'ไฟเขียวเพิ่มหมื่นอัตรารับแบ่ง’สพม.’ใหม่ ชง’ก.ค.ศ.’เคาะพันตำแหน่งลดภาระครู หลังเคลียร์ตัวเลขเกษียณ-ปรับลง38ค(2)',
                'content' => 'วันที่ 26 สิงหาคม 2568 ว่าที่ร้อยตรี ธนุ วงษ์จินดา เลขาธิการคณะกรรมการการศึกษาขั้นพื้นฐาน (เลขาธิการ กพฐ.)เปิดเผยภายหลัง เป็นประธานการประชุมผู้บริหาร สพฐ. ครั้งที่ 31/2568 ว่า วันนี้ ตนได้เน้นย้ำในที่ประชุมหลายเรื่อง โดยเฉพาะ การแก้ปัญหาภาวะทุพโภชนาการของเด็กปฐมวัยและเด็กในวัยเรียน ซึ่งจากการจัดทำข้อมูลสุขภาพนักเรียน พบว่า นักเรียนที่มีภาวะส่วนสูงต่ำกว่าเกณฑ์ (เตี้ย) ปี 2567 มีจำนวน 543,253 คน และปี 2568 มีจำนวน 403,987 คน เท่ากับลดลง 139,266 คน คิดเป็นร้อยละ 25.63 แสดงให้เห็นว่าส่วนหนึ่งเป็นผลมาจากการส่งเสริมให้นักเรียนได้รับอาหารเสริม (นม) โรงเรียน ที่มีคุณภาพอย่างเหมาะสมและต่อเนื่อง ดังนั้น หากเพิ่มระยะเวลาในการจัดอาหารเสริม (นม) โรงเรียน จากเดิม 260 วัน เป็น 365 วัน จะช่วยเสริมสร้างสุขภาพและแก้ปัญหาภาวะทุพโภชนาการในเด็กนักเรียน ให้เจริญเติบโต สูงดีสมส่วนได้ สพฐ. จึงมีหนังสือถึงรัฐมนตรีว่าการกระทรวงศึกษาธิการ เรื่อง การเพิ่มระยะเวลาในการจัดอาหารเสริม (นม) โรงเรียน จากเดิมเด็กดื่มนม 260 วัน เป็น 365 วัน ซึ่ง ศ.ดร.นฤมล ภิญโญสินวัฒน์ รัฐมนตรีว่าการกระทรวงศึกษาธิการ ได้ลงนามหนังสือดังกล่าว ถึงรัฐมนตรีว่าการกระทรวงเกษตรและสหกรณ์ เรียบร้อยแล้ว เมื่อวันที่ 5 สิงหาคม 2568 ที่ผ่านมา และเมื่อ รมว.เกษตร ลงนามเห็นชอบ เราจะทำเรื่องเข้าเสนอคณะรัฐมนตรีเพื่อของบฯกลางต่อไป ซึ่งเรื่องนี้จะได้ประโยชน์ 2 ฝ่าย คือให้เด็กได้ดื่มนมทุกวัน เพื่อทำให้ภาวะทางโภชนาการของเด็กดีขึ้น โดยเฉพาะเด็กที่อยู่ในวัยกำลังเติบโต หากได้กินนมทุกวันสุขภาพก็จะดีขึ้น แข็งแรงสมวัย เรียนรู้ได้อย่างเต็มที่ และยังได้ช่วยเหลือพี่น้องเกษตรกรที่เลี้ยงโคนมในประเทศด้วยหลักสูตรออนไลน์ที่ดีที่สุด เลขาธิการ กพฐ.กล่าวต่อไปว่า นอกจากนี้ที่ประชุมยังได้ติดตามสถานการณ์พายุ “คาจิกิ” ตามประกาศของกรมอุตุนิยมวิทยา โดย รมว.ศึกษาธิการ มีความห่วงใยนักเรียน ครูและบุคลากรทางการศึกษา และสถานศึกษา ในหลายพื้นที่ของประเทศที่อาจได้รับผลกระทบ โดยเฉพาะในพื้นที่ภาคตะวันออกเฉียงเหนือและภาคเหนือตอนบน ซึ่งตอนนี้เราได้ติดตามกันอย่างใกล้ชิด โดยได้เน้นย้ำผู้บริหารสำนักงานเขตพื้นที่การศึกษา ผู้บริหารสถานศึกษา ให้ช่วยกันเฝ้าระวังและเตรียมความพร้อมรับมือสถานการณ์ ไม่ว่าจะเป็นการเคลื่อนย้ายสิ่งของที่อาจน้ำท่วมและเสียหายขึ้นที่สูง ดูแลอุปกรณ์-ระบบไฟฟ้าภายในโรงเรียน รวมถึงระบบความปลอดภัยต่างๆ และประสานกับหน่วยงานข้างเคียง อาทิ หน่วยป้องกันและบรรเทาสาธารณภัย(ปภ.)จังหวัด หรือฝ่ายปกครองในพื้นที่ อีกสิ่งที่ต้องเฝ้าระวังเป็นพิเศษ คือ หากเกิดเหตุจำเป็น เช่น ถนนขาด น้ำท่วม โรงเรียนได้รับความเสียหาย ไม่สามารถจัดการเรียนการสอนได้ ผู้บริหารโรงเรียนสามารถสั่งปิดโรงเรียนได้ทันที โดยเน้นเรื่องความปลอดภัยของนักเรียนและครูเป็นสำคัญ จากนั้นให้ประสานกับทางสำนักงานเขตพื้นที่ฯ ปภ. ฝ่ายพลเรือนหรือหน่วยทหารเข้าไปดูแลให้การช่วยเหลือโดยเร็วต่อไป',
                'source_url' => 'https://www.kroobannok.com/92908',
                'image_url' => 'https://www.kroobannok.com/news_pic/p18884100852.jpg',
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ],
            [
                'title' => 'สพฐ.คิดใหญ่ปรับข้อสอบทุกประเภทเพิ่มสัดส่วนอัตนัย 50% เลิกแล้วกาอย่างเดียว ทำข้อสอบต้องคิด วิเคราะห์ด้วย',
                'content' => 'เมื่อวันที่ 26 สิงหาคม 2568 ว่าที่ร้อยตรี ธนุ วงษ์จินดา เลขาธิการคณะกรรมการการศึกษาขั้นพื้นฐาน(กพฐ.) กล่าวถึงนโยบายการปรับเนื้อหาวิชาประวัติศาสตร์และหน้าที่พลเมือง ว่า ขณะนี้มีความคืบหน้ามาก โดยจะให้เพิ่มเนื้อหาเรื่องภูมิศาสตร์เข้าไปด้วย เป็น ภูมิศาสตร์ ประวัติศาสตร์ และหน้าที่พลเมือง เพื่อต้องการปลูกฝังให้เด็กรักชาติ แต่ที่สำคัญอาจต้องไปเริ่มที่กระบวนการจัดการเรียนการสอน ต้องสอนประวัติศาสตร์ในเชิงสร้างสรรค์ให้เด็กคิด วิเคราะห์ ไม่ใช่แค่ท่องจำ เช่น กรณีที่เราเสียกรุงครั้งที่ 2 ไม่ใช่แค่จำว่าเสียกรุงเมื่อไหร่ แต่ต้องสอนให้เด็กคิดว่าทำไมเราถึงเสียกรุง ถ้าเราอยู่ในยุคนั้น เราจะทำอย่างไรให้เราไม่เสียกรุง ซึ่งตอนนี้เรากำลังปรับทั้งหลักสูตรและปรับวิธีการจัดการเรียนการสอนเป็นแบบ Active Learning ให้เด็กคิด วิเคราะห์ รวมถึงต้องปลูกฝังให้เด็กรักชาติ รักสถาบันพระมหากษัตริย์ โดยต้องปลูกฝังตั้งแต่เล็ก ๆ “การเรียนการสอนวิชาประวัติศาสตร์เราต้องมาทบทวนเนื้อหากันใหม่ ต้องให้ทันสมัย ส่วนที่รมว.ศึกษาธิการ ต้องการให้เพิ่มสัดส่วนวิชาประวัติศาสตร์ และหน้าพลเมืองในการสอบเข้า ม.1 และ ม.4 นั้น ก็อยู่ในสัดส่วนเดิมในสาระการเรียนรู้สังคมศึกษา แต่จะเน้นเรื่องของภูมิศาสตร์ ประวัติศาสตร์ และหน้าที่พลเมือง มากขึ้น และเท่าที่ผมดูแล้วคิดว่า คงไม่ใช่แค่สอบเข้าเท่านั้น แต่จะใช้ในการสอบจบของเด็กด้วย เพราะถ้าเด็กเรียนแล้วไม่ได้สอบเขาก็จะไม่ตั้งใจเรียน แม้แต่การสอบบรรจุครู หรือ การเข้าสู่ตำแหน่งต่าง ๆ ทั้งผอ. หรือ รอง ผอ.สถานศึกษา ผอ.เขตพื้นที่ฯ ก็มีข้อสอบวิชาเหล่านี้อยู่ด้วยแล้ว นอกจากนี้ผมกำลังคิดต่ออีกว่า อาจจะต้องรื้อฟื้นข้อสอบอัตนัย โดยเพิ่มสัดส่วนข้อสอบอัตนัยในการสอบทุกประเภทเข้ามาด้วย เพราะการเขียนจะทำให้เด็กเกิดความคิด วิเคราะห์ และสังเคราะห์ แต่ถ้าเป็นข้อสอบปรนัยบางทีเด็กอาจจะไม่ได้อ่านคำถามด้วยซ้ำ กาอย่างเดียว ไม่ได้เกิดความคิด วิเคราะห์ เพราะฉะนั้นต้องทำให้ครบทั้งฟัง พูด อ่านเขียน โดยผมให้นโยบายไปแล้วให้ฝ่ายวิชาการไปคิดถึงเรื่องสัดส่วนข้อสอบระหว่างปรนัย กับ อัตนัย ซึ่งอาจจะมีความเป็นไปได้ว่าจะให้ทำ 50 : 50” เลขาธิการกพฐ.กล่าว',
                'source_url' => 'https://www.kroobannok.com/92902',
                'image_url' => 'https://www.kroobannok.com/news_pic/p41795371148.jpg',
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ],
            [
                'title' => 'ราชกิจจานุเบกษา เผยแพร่ ข้อบังคับคุรุสภา ว่าด้วยมาตรฐานวิชาชีพครูปฐมวัย พ.ศ.2568',
                'content' => 'ผศ.ดร.อมลวรรณ  วีระธรรมโม เลขาธิการคุรุสภา กล่าวว่า คุรุสภาได้กำหนดมาตรฐานวิชาชีพครูปฐมวัยเป็นการเฉพาะ เพื่อให้ผู้ประกอบวิชาชีพครูในระดับปฐมวัย มีสมรรถนะทางวิชาชีพสอดคล้องกับบริบทความเปลี่ยนแปลงต่าง ๆ ที่เกี่ยวข้องกับวิชาชีพครูในระดับปฐมวัย ซึ่งเป็นรากฐานสำคัญของการเตรียมความพร้อมของผู้เรียน เพื่อรับการศึกษาในขั้นถัดไป   อาศัยอำนาจตามความในมาตรา 9 วรรรคหนึ่ง (1) (11) (ฉ) และมาตรา 49 แห่งพระราชบัญญัติสภาครูและบุคลากรทางการศึกษา พ.ศ. 2546 ประกอบกับมติคณะกรรมการคุรุสภา ในการประชุมครั้งที่ 4/2568 เมื่อวันที่ 2 พฤษภาคม 2568 โดยความเห็นชอบของรัฐมนตรีว่าการกระทรวงศึกษาธิการ จึงออกข้อบังคับคุรุสภาไว้ ซึ่งประกาศในราชกิจจานุเบกษา หน้า 105 เล่มที่ 142 ตอนพิเศษ 279 ง เมื่อวันที่ 22 สิงหาคม 2568 และมีผลใช้บังคับตั้งแต่วันประกาศในราชกิจจานุเบกษาเป็นต้นไป   ทั้งนี้ สามารถดูรายละเอียดเพิ่มเติมได้ที่เว็บไซต์คุรุสภา www.ksp.or.th หรือสอบถามข้อมูลเพิ่มเติมที่สำนักงานเลขาธิการคุรุสภา สำนักมาตรฐานวิชาชีพ หมายเลขโทรศัพท์ 0 2280 0048',
                'source_url' => 'https://www.kroobannok.com/92907',
                'image_url' => 'https://www.kroobannok.com/news_pic/p79530480247.jpg',
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ],
            [
                'title' => '"เสมา1" ตอบชัดเหตุผล จัดตั้ง "สหกรณ์กลาง สกสค." เป็นนโยบายรัฐบาลที่ต้องการแก้ปัญหาหนี้ครัวเรือน ไม่อุ้มหนี้เน่า ถ้า สกสค.ทำได้ก็ถือเป็นเรื่องดี',
                'content' => 'เมื่อวันที่ 25 สิงหาคม 2568 ศ.ดร.นฤมล ภิญโญสินวัฒน์ รัฐมนตรีว่าการกระทรวงศึกษาธิการ กล่าวถึงความคืบหน้าโครงการจัดตั้ง “สหกรณ์กลาง สกสค.” ว่า เรื่องนี้เป็นหน้าที่ของสำนักงานคณะกรรมการส่งเสริมสวัสดิการและสวัสดิภาพครูและบุคลากรทางการศึกษา(สกสค.)ในการดำเนินการจัดตั้งและผลักดัน โดยรัฐมนตรีมีหน้าที่มอบนโยบาย ช่วยนำเรื่องเสนอคณะรัฐมนตรี(ครม.) และช่วยชี้แจงผลักดันให้ ครม.เห็นชอบ ส่วนเรื่องการขอเงินสนับสนุนเพื่อนำมาทดแทนกรณีที่มีการลดหย่อนดอกเบี้ยให้แก่ครูที่ต้องการปรับโครงสร้างหนี้ นั้น หากมีเหตุผลและหลักการที่ดี เชื่อว่า ครม.จะไม่ขัดข้องและพร้อมที่จะช่วย เพราะการแก้ปัญหาหนี้ครัวเรือนเป็นนโยบายเร่งด่วนของรัฐบาลที่นายกรัฐมนตรีแถลงต่อรัฐสภา โดยในจำนวนนั้นมีครูรวมอยู่ด้วย ดังนั้นการจัดตั้งและผลักดันให้สำเร็จจึงเป็นของ สกสค. ที่มีหน้าที่ในการบริหารจัดการสวัสดิการ สวัสดิภาพ เพื่อยกระดับคุณภาพชีวิตของครูและบุคลากรทางการศึกษา “สกสค.ต้องไปประสานหน่วยงานที่เกี่ยวข้องแล้วตั้งเรื่องเข้ามา แล้วอาจารย์จะเซ็นเข้า ครม. แต่ขณะนี้ยังไม่ได้ส่งกลับมา เพราะเขาตั้งเป้าว่า จะเห็นเป็นรูปเป็นร่างในประมาณเดือนกันยายน เพราะฉะนั้นพรุ่งนี้( 26 สิงหาคม) น่าจะไม่ทันเสนอ ครม.”รมว.ศึกษาธิการกล่าว ผู้สื่อข่าวถามว่า การตั้งสหกรณ์กลาง สกสค.มีเป้าหมายหนึ่งที่จะอุ้มหนี้เน่าของการฌาปนกิจสงเคราะห์ช่วยเพื่อนครูและบุคลากรทางการศึกษา(ช.พ.ค.)หรือไม่ รมว.ศึกษาธิการ กล่าวว่า สกสค.ต้องไปกำหนดหลักเกณฑ์ว่า จะมีกลุ่มไหนบ้างที่จะเข้ามาปรับโครงสร้างหนี้กับสหกรณ์กลางของ สกสค.ได้ ซึ่งจะต้องดูให้รอบคอบ และมีหลักเกณฑ์ที่ชัดเจน ไม่ได้มีเป้าหมายเพื่อแก้หนี้ส่วนนั้นแน่นอน คนที่คิดอย่างนั้นน่าจะเป็นความเข้าใจผิด',
                'source_url' => 'https://www.kroobannok.com/92899',
                'image_url' => 'https://www.kroobannok.com/news_pic/p54663810453.jpg',
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ],
            [
                'title' => '"ครูแหม่ม" กำชับ สพฐ.เฝ้าระวังพายุคาจิกิ ดูแลครู-นักเรียน พร้อมจัดเตรียมที่พัก-เสบียง ย้ำหากจำเป็นสั่งหยุดเรียนได้ทันที',
                'content' => 'เมื่อวันที่ 25 สิงหาคม 2568 ศ.ดร.นฤมล ภิญโญสินวัฒน์ รัฐมนตรีว่าการกระทรวงศึกษาธิการ กล่าวถึงสถานการณ์พายุโซนร้อนคาจิกิที่อาจจะส่งผลกระทบต่อประเทศไทยว่า ตนได้ติดตามสถานการณ์อย่างต่อเนื่อง พร้อมกำชับสำนักงานคณะกรรมการการศึกษาขั้นพื้นฐาน (สพฐ.)ให้ดูแลสวัสดิภาพของนักเรียน ครูและบุคลากรทางการศึกษา ในสถานศึกษาทั่วประเทศ โดยให้สำนักงานเขตพื้นที่การศึกษา และศูนย์การศึกษาพิเศษทุกแห่ง ดูแลให้การช่วยเหลือนักเรียน ครู โรงเรียนในสังกัด รวมถึงทรัพย์สินทางราชการ ตามมาตรการเฝ้าระวังและป้องกันอุทกภัย “กระทรวงศึกษาธิการมีความห่วงใยในความปลอดภัยของนักเรียน ครู และบุคลากรการศึกษาทุกคน เราไม่ต้องการให้ใครได้รับผลกระทบจากภัยธรรมชาติครั้งนี้ จึงได้กำชับให้ สพฐ. และหน่วยงานที่เกี่ยวข้องทุกระดับ เตรียมมาตรการป้องกันและช่วยเหลืออย่างใกล้ชิด หากเกิดฝนตกหนัก น้ำท่วมฉับพลัน หรือน้ำป่าไหลหลาก โรงเรียนสามารถประกาศหยุดเรียนได้ทันที เพื่อปกป้องความปลอดภัยของเด็ก ๆ และครูเป็นสำคัญ”ศ.ดร.นฤมล กล่าวและว่านอกจากนี้ยังได้มอบหมายให้ทุกหน่วยงานในสังกัดจัดเตรียมสถานที่พักพิงชั่วคราวสำหรับนักเรียนและครูที่อาจได้รับผลกระทบ เพื่อให้มีที่หลบภัยที่ปลอดภัย รวมถึง เสบียงอาหาร น้ำดื่ม ยารักษาโรคด้วย ทั้งนี้ ขอให้ประสานงานกับหน่วยงานท้องถิ่น องค์กรปกครองส่วนท้องถิ่น และหน่วยงานด้านการป้องกันภัยพิบัติในพื้นที่ เพื่อให้การช่วยเหลือเป็นไปอย่างรวดเร็วและทั่วถึง หากมีเหตุฉุกเฉินเกิดขึ้น ว่าที่ร้อยตรี ธนุ วงษ์จินดา เลขาธิการคณะกรรมการการศึกษาขั้นพื้นฐาน (กพฐ.) กล่าวว่า จากการติดตามรายงานของกรมอุตุนิยมวิทยา ที่รายงานสถานการณ์พายุไต้ฝุ่น “คาจิกิ” บริเวณทะเลจีนใต้ตอนบน มีแนวโน้มที่จะอ่อนกำลังลงเป็นหย่อมความกดอากาศต่ำกำลังแรงและเคลื่อนเข้าสู่ประเทศไทยบริเวณภาคเหนือตอนบน ส่งผลให้ในช่วงวันที่ 25 – 26 สิงหาคม 2568 นี้ ภาคตะวันออกเฉียงเหนือตอนบนจะมีฝนตกหนักถึงหนักมากหลายพื้นที่ กับมีลมแรง ส่วนภาคเหนือจะได้รับผลกระทบในช่วงวันที่ 25 – 27 สิงหาคม 2568 โดยเฉพาะบริเวณที่ใกล้กับเส้นทางเดินพายุ ได้แก่ จังหวัดบึงกาฬ หนองคาย นครพนม สกลนคร อุดรธานี หนองบัวลำภู เลย อุตรดิตถ์ น่าน พะเยา แพร่ เชียงราย เชียงใหม่ ลำปาง ลำพูน และแม่ฮ่องสอน สำหรับภาคกลาง ภาคตะวันออก และภาคใต้ฝั่งตะวันตก จะได้รับผลกระทบทางอ้อมจากพายุ ขอให้ประชาชนในบริเวณดังกล่าวระวังอันตรายจากฝนตกหนักถึงหนักมาก ลมแรง และฝนที่ตกสะสม ซึ่งอาจทำให้เกิดน้ำท่วมฉับพลัน และน้ำป่าไหลหลาก โดยเฉพาะพื้นที่ลาดเชิงเขาใกล้ทางน้ำไหลผ่านและพื้นที่ลุ่ม นั้น สำนักงานคณะกรรมการการศึกษาขั้นพื้นฐาน (สพฐ.)มีความห่วงใยสวัสดิภาพของนักเรียน ครูและบุคลากรทางการศึกษา ในสถานศึกษาทั่วประเทศ จึงกำชับสถานศึกษาในสังกัดให้เฝ้าระวัง เตรียมพร้อมรับมือสถานการณ์ พร้อมทั้งเน้นย้ำให้สำนักงานเขตพื้นที่การศึกษาและศูนย์การศึกษาพิเศษทุกแห่ง ดูแลให้การช่วยเหลือนักเรียน ครู โรงเรียนในสังกัด รวมถึงทรัพย์สินทางราชการ ตามมาตรการเฝ้าระวังและป้องกันอุทกภัยของ สพฐ. ทั้งมาตรการระยะสั้น อาทิ วิเคราะห์ความเสี่ยงในการเดินทางของนักเรียน จัดเตรียมที่พักพิงหากจำเป็นต้องมีการเคลื่อนย้าย สำรวจ/ซ่อมแซมอาคาร ระบบไฟฟ้า-ประปาให้มีความพร้อม และประสานหน่วยงานที่เกี่ยวข้องในจังหวัด หากมีเหตุจำเป็นให้ประกาศหยุดเรียนได้ทันที รวมถึงมาตรการระยะยาว แผนเผชิญเหตุ และรายงานสถานการณ์ทุกวัน พร้อมทั้งติดตามประกาศจากกรมอุตุนิยมวิทยาอย่างใกล้ชิด โดยได้แจ้งให้สำนักงานเขตพื้นที่การศึกษาทุกแห่งทราบด้วยว่า หากมีเหตุด่วน เหตุฉุกเฉินที่ต้องได้รับการแก้ไขอย่างเร่งด่วน ทุกเขตสามารถประสานโดยตรงมาที่ เลขาธิการ กพฐ. และทีมผู้บริหารทุกคนได้ตลอด 24 ชั่วโมง เพื่อรับมือและแก้ไขสถานการณ์ได้อย่างทันท่วงที',
                'source_url' => 'https://www.kroobannok.com/92898',
                'image_url' => 'https://www.kroobannok.com/news_pic/p57365790437.jpg',
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ],
            [
                'title' => 'มาตรฐานสำนักงานเขตพื้นที่การศึกษา พ.ศ. 2568',
                'content' => 'แนวทางการขับเคลื่อนกีฬามวยไทยในสถานศึกษาขั้นพื้นฐาน  ตามที่ สำนักงานคณะกรรมการการศึกษาขั้นพื้นฐาน ขอให้สำนักงานเขตพื้นที่ การศึกษาดำเนินการแจ้งให้สถานศึกษาในสังกัดร่วมกันส่งเสริมให้นักเรียนมีสุขภาพดีด้วยการออกกำลังกายโดยใช้มวยไทยและส่งเสริม Soft Power ของประเทศไทย และเป็นการส่งเสริมให้ครูและนักเรียนเกิดความรักและภาคภูมิใจในเอกลักษณ์ของชาติ ทั้งนี้ สถานศึกษาพิจารณาบูรณาการในรายวิชาพื้นฐานตามกลุ่มสาระการเรียนรู้ต่าง ๆ ที่เกี่ยวข้อง หรือจัดเป็นรายวิชาเพิ่มเติม หรือกิจกรรมพัฒนาผู้เรียน หรือกิจกรรมเสริมหลักสูตรต่าง ๆ โดยให้คำนึงถึงความปลอดภัย ความเหมาะสมกับช่วงวัยและพัฒนาการของผู้เรียนเป็นสำคัญ ความละเอียดแจ้งแล้ว นั้น ในการนี้ เพื่อให้เกิดความชัดเจนในการขับเคลื่อนกีฬามวยไทยในสถานศึกษาขั้นพื้นฐาน และการจัดการเรียนรู้กีฬามวยไทยในสถานศึกษา จึงเห็นควรเผยแพร่ประชาสัมพันธ์แนวทางการขับเคลื่อน กีฬามวยไทยในสถานศึกษาขั้นพื้นฐาน และแหล่งข้อมูลเพื่อเผยแพร่เอกสารที่เกี่ยวข้อง ผ่านทางเว็บไซต์ https://ww.curriculum68.info/projects/muaythai.html เพื่อให้สถานศึกษาใช้เป็นแนวทางในการบูรณาการ กีฬามวยไทยในการจัดการเรียนรู้ต่าง ๆ ตามบริบท ความพร้อม และจุดเน้นของสถานศึกษา รวมทั้งความถนัดและความสนใจของผู้เรียน ',
                'source_url' => 'https://www.kroobannok.com/92897',
                'image_url' => 'https://www.kroobannok.com/news_pic/p81603970411.jpg',
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ],
            [
                'title' => 'แนวทางการขับเคลื่อนกีฬามวยไทยในสถานศึกษาขั้นพื้นฐาน',
                'content' => 'การสร้างสื่อการเรียนการสอนที่มีคุณภาพเป็นสิ่งสำคัญในการดึงดูดความสนใจของนักเรียนในยุคดิจิทัล ผู้เชี่ยวชาญด้านสื่อการสอนได้แนะนำแนวคิดใหม่ๆ ในการออกแบบสื่อที่ตอบโจทย์ความต้องการของผู้เรียนในศตวรรษที่ 21 รวมถึงการใช้เทคโนโลยีและแพลตฟอร์มออนไลน์เพื่อสร้างสื่อที่มีความหลากหลายและเข้าถึงได้ง่าย การพัฒนาสื่อการสอนที่ทันสมัยจะช่วยให้ครูสามารถนำเสนอเนื้อหาที่ซับซ้อนให้เข้าใจง่ายขึ้น และทำให้นักเรียนมีส่วนร่วมในกระบวนการเรียนรู้มากขึ้น',
                'source_url' => 'https://www.kroobannok.com/92877',
                'image_url' => 'https://www.kroobannok.com/news_pic/p29586791639.jpg',
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ],
            [
                'title' => '100 ปี กับการยืมคุณภาพ ตรรกะทางสังคมของอุดมศึกษาไทย',
                'content' => 'เมื่อเร็วๆ นี้ ทางมหาวิทยาลัยฮ่องกง ได้จัดงาน Higher Education Research Association (HERA) ครั้งที่ 11 โดยได้เชิญนักวิชาการจากทั่วโลกเข้ามาแลกเปลี่ยนความคิด ภายใต้หัวข้อ อนาคตของการอุดมศึกษา : ความท้าทายเก่าและใหม่ (The future of Higher Education: Facing the Old and the New Challenges) ในการนี้ ดร.รัตนา แซ่เล้า ผู้รับพระราชทานทุนมูลนิธิอานันทมหิดล แผนกธรรมศาสตร์ ซึ่งในปี 2558 ได้ตีพิมพ์หนังสือเรื่อง A Critical Study of Thailand’s Higher Education Reforms: The culture of borrowing กับสำนักพิมพ์ Routledge ซึ่งเป็นการวิเคราะห์ วิพากษ์ และวิจัยบทบาทของความคิดของตะวันตกที่ที่อิทธิพลกับการพัฒนาการอุดมศึกษาไทย ได้เข้าร่วมในการประชุม พร้อมนำ เสนอผลงานทางวิชาการเรื่อง การยืมคุณภาพ: ตรรกะทางสังคมของอุดมศึกษาไทย (Borrowing quality: The sociologic of Thailand’s higher education) ดร.รัตนา แซ่เล้า ผู้รับพระราชทานทุนมูลนิธิอานันทมหิดล แผนกธรรมศาสตร์ ได้กล่าวว่า “รูปแบบการอุดมศึกษาแบบตะวันตก มีอิทธิพลต่อการศึกษาในเอเชียอย่างมาก รูปแบบการอุดมศึกษาของยุโรป โดยเฉพาะจากฝรั่งเศสเรื่อง Grande Ecole จะมีอิทธิพลเหนือกว่าในช่วงแรกๆ ของการสร้างชาติและการพัฒนาให้เป็นสมัยใหม่ อย่างไรก็ตามนับตั้งแต่การสิ้นสุดสงครามโลกครั้งที่สอง รูปแบบการอุดมศึกษาจากสหรัฐอเมริกา เริ่มเข้ามามีอิทธิพลต่อการพัฒนามหาวิทยาลัยในเอเชียเพิ่มขึ้น ซึ่งทั้งที่จริงแล้วสหรัฐอเมริกาเองก็ได้ยืมรูปแบบมาจากหลายแหล่ง เป็นผลพลอยได้จากแนวคิดหลักสามประการ ได้แก่รูปแบบวิทยาลัยของอังกฤษ อุดมคติมหาวิทยาลัยด้านวิจัยของเยอรมนีในช่วงปลายศตวรรษที่ 19 และแนวคิดแบบอเมริกันเรื่องการให้บริการต่อสังคม',
                'source_url' => 'https://www.kroobannok.com/92869',
                'image_url' => 'https://www.kroobannok.com/news_pic/p16432340958.jpg',
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ],
            [
                'title' => 'เปิดยุทธศาสตร์ใหม่ สมศ. ยกระดับจากการประเมินคุณภาพภายนอก สู่ "หุ้นส่วนพัฒนาคุณภาพการศึกษา"',
                'content' => 'สำนักงานรับรองมาตรฐานและประเมินคุณภาพการศึกษา หรือ สมศ. เปิดทิศทางใหม่ มุ่งยกระดับระบบประเมินคุณภาพการศึกษาไทยสู่อนาคตที่ยั่งยืน ด้วยแนวคิด ‘ลดภาระ เพิ่มคุณภาพ’ พร้อมพัฒนาผู้ประเมินภายนอกสู่บทบาท ‘ที่ปรึกษาคุณภาพ’ และสร้างกลไกความร่วมมือกับภาคีเครือข่ายในพื้นที่ทั่วประเทศ ศาสตราจารย์ ดร.องอาจ นัยพัฒน์ ผู้อำนวยการ สำนักงานรับรองมาตรฐานและประเมินคุณภาพการศึกษา หรือ สมศ. เปิดเผยว่า ทิศทางและแผนการดำเนินงานของ สมศ. ต่อไปนี้ จะเป็นการมุ่งประเมินเชิงส่งเสริม สร้างความร่วมมือ เชื่อมโยงผลสู่การพัฒนาอย่างยั่งยืน เพื่อให้ สมศ. เป็นหน่วยตรวจประเมินคุณภาพภายนอกระดับชาติ ที่ส่งเสริมคุณภาพการศึกษาอย่างแท้จริง ด้วยแนวคิด “ลดภาระ เพิ่มคุณภาพ” ผ่านการใช้เทคโนโลยีดิจิทัล การปรับบทบาทผู้ประเมินภายนอก และกลไกความร่วมมือเชิงรุกกับภาคีเครือข่ายในพื้นที่ ตลอดระยะเวลาหลายปีที่ผ่านมา สมศ.ได้รับเสียงสะท้อนจากสถานศึกษาว่าการประเมินเป็นภาระ ใช้เวลามาก ต้องเตรียมเอกสารจำนวนมาก และไม่ก่อให้เกิดประโยชน์เชิงพัฒนาอย่างแท้จริง สมศ.จึงได้พลิกโฉมการดำเนินงาน ปรับกระบวนการโดยลดจำนวนวันลงพื้นที่ตรวจเยี่ยมเหลือเพียงวันเดียว นำระบบเทคโนโลยีสารสนเทศมาใช้ในการจัดเก็บข้อมูลผ่านระบบดิจิทัล และใช้ “ซอฟต์ไฟล์” (Soft file) จากหน่วยงานต้นสังกัดตลอดช่วง 2-3 ปีที่ผ่านมา เพื่อไม่ให้รบกวนการเรียนการสอน เป็นการเปลี่ยนภาพจำเก่า สู่ระบบประเมินที่ยืดหยุ่น เข้าถึงง่าย และสามารถนำผลการประเมินคุณภาพภายนอกไปใช้ได้จริง',
                'source_url' => 'https://www.kroobannok.com/92814',
                'image_url' => 'https://www.kroobannok.com/news_pic/p42139481135.jpg',
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ],
            [
                'title' => 'รัฐมนตรีว่าการกระทรวงศึกษาธิการคนใหม่ พร้อมคณะ เข้ารับตำแหน่งและพบปะผู้บริหาร ศธ.',
                'content' => 'เมื่อวันที่ 8 กรกฎาคม 2568 ศาสตราจารย์ นฤมล ภิญโญสินวัฒน์ รัฐมนตรีว่าการกระทรวงศึกษาธิการ พร้อมด้วยผู้ช่วยศาสตราจารย์ ลิณธิภรณ์ วริณวัชรโรจน์ และนาย เทวัญ ลิปตพัลลภ รัฐมนตรีช่วยว่าการฯ ได้เข้าสักการะสิ่งศักดิ์สิทธิ์ประจำกระทรวงศึกษาธิการ เพื่อความเป็นสิริมงคลในการเริ่มปฏิบัติหน้าที่ จากนั้นได้พบปะผู้บริหารระดับสูงของกระทรวง ณ ห้องราชวัลลภ โดยมีปลัดกระทรวง เลขาธิการหน่วยงานหลัก และผู้บริหารในสังกัดร่วมให้การต้อนรับอย่างพร้อมเพรียง รมว.ศธ. ยืนยันจะสานต่อนโยบายที่ดีจากรัฐบาลชุดก่อน และย้ำว่าทุกฝ่ายคือ “คนของกระทรวง” พร้อมร่วมมือทำงานอย่างเป็นครอบครัวเดียวกัน โดยให้ความสำคัญกับการพัฒนาสวัสดิการครู การลดภาระงาน ปรับเกณฑ์วิทยฐานะ และการพัฒนาหลักสูตรประวัติศาสตร์และหน้าที่พลเมือง เพื่อปลูกฝังความเข้าใจในระบอบประชาธิปไตย',
                'image_url' => 'https://www.kroobannok.com/news_pic/p82951881112.jpg',
                'source_url' => 'https://www.kroobannok.com/92784',
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ],
        ];

        DB::table('news')->insert($newsArticles);
    }
}
